# Week 2. Cleaned version
Cognitive Systems for Health Technology Applications<br>
28.1.2018<br>
Sakari Lukkarinen<br>
Helsinki Metropolia University of Applied Sciences

## Description
This code shows how to:
- import the data to jupyter notebook using pandas
- replace columnwise the missing values with the most common values 
- scale the data to 0..1 using the min and max
- extract only those variables we are interested in

In [1]:
# Import libraries
# %pylab inline
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

import pandas as pd

In [19]:
pd.__version__

'0.20.3'

In [9]:
# location of the dataset
filename = 'http://archive.ics.uci.edu/ml/machine-learning-databases/heart-disease/processed.cleveland.data'

# column names for the data
colnames = ['age','sex','cp','tresbps','chol',
            'fbs','restecg','thalach','exang',
            'oldpeak','slope','ca','thal','num']

# read data to data frame
df = pd.read_csv(filename, 
                 names = colnames, 
                 na_values = '?')

In [10]:
df.describe()

,age,sex,cp,tresbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,num
count,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,299.000000,301.000000,303.000000
mean,54.438944,0.679868,3.158416,131.689769,246.693069,0.148515,0.990099,149.607261,0.326733,1.039604,1.600660,0.672241,4.734219,0.937294
std,9.038662,0.467299,0.960126,17.599748,51.776918,0.356198,0.994971,22.875003,0.469794,1.161075,0.616226,0.937438,1.939706,1.228536
min,29.000000,0.000000,1.000000,94.000000,126.000000,0.000000,0.000000,71.000000,0.000000,0.000000,1.000000,0.000000,3.000000,0.000000
25%,48.000000,0.000000,3.000000,120.000000,211.000000,0.000000,0.000000,133.500000,0.000000,0.000000,1.000000,0.000000,3.000000,0.000000
50%,56.000000,1.000000,3.000000,130.000000,241.000000,0.000000,1.000000,153.000000,0.000000,0.800000,2.000000,0.000000,3.000000,0.000000
75%,61.000000,1.000000,4.000000,140.000000,275.000000,0.000000,2.000000,166.000000,1.000000,1.600000,2.000000,1.000000,7.000000,2.000000
max,77.000000,1.000000,4.000000,200.000000,564.000000,1.000000,2.000000,202.000000,1.000000,6.200000,3.000000,3.000000,7.000000,4.000000

In [21]:
np.sum(~np.isnan(df))

age        303
sex        303
cp         303
tresbps    303
chol       303
fbs        303
restecg    303
thalach    303
exang      303
oldpeak    303
slope      303
ca         299
thal       301
num        303
dtype: int64

In [18]:
# Replace missing values with mode
# df = df.where(~np.isnan(df), df.mode(), axis = 'columns')
# df.fillna(0)
df.where(pd.notna(df), df.mean(), axis='columns')

AttributeError: module 'pandas' has no attribute 'notna'

In [7]:
# Output value: 0 = normal, 1 = heart disease
labels = (df['num'] > 0).values

In [8]:
# Scale the attributes between min and max
df2 = (df - df.min())/(df.max() - df.min())

# Cholesterol values were originally all zeros
df2['chol'] = 0

# Select all attributes that were measured without angiography
columns = ['age', 'sex', 'cp', 'tresbps', 
           'chol', 'fbs', 'restecg', 'thalach', 
           'exang', 'oldpeak', 'slope']

# Convert the data to numpy array
data = df2[columns].values

In [11]:
# Now you are ready to use the labels and data for neural networks!